# -*- coding: utf-8 -*-
"""
    Author: 阿慕路泽
    Description：
"""


CodeInfo = {
    0: '请求成功',

    101: '数据库操作失败',
    103: '参数缺少或错误',

    100001: '用户注册失败',
    100002: '用户注册成功',
    100003: '用户注销成功',
    100004: '用户注销失败',
    100005: '用户登录成功',
    100006: '用户登录失败',
    100007: '用户登出成功',
    100008: '用户登出失败',
    100009: '用户Email已存在',
    100010: '用户不存在',
    100011: '用户绑定角色失败',
    100012: '用户名已存在',

    101001: '密码错误',
    101002: '原始密码错误',
    101003: '两次新密码输入不同',
    101004: '原始密码与新密码相同',
    101005: '密码需要至少6位，并且包含字母和数字',

    102001: '验证头信息错误',
    102002: 'Token 已经过期',
    102003: '未提供认证的 Token',

    103001: '没有权限',
}